export const LevelSetting = {
    1: 1000,
    2: 2000
}

export const LevelName: { [key: number]: string } = {
    1: '练气一层',
    2: '练气二层',
    3: '练气三层',
    4: '练气四层',
    5: '练气五层',
    6: '练气六层',
    7: '练气七层',
    8: '练气八层',
    9: '练气九层',
    10: '练气巅峰',
    11: '练气大圆满',
    12: '半步筑基',
    13: '筑基初期',
    14: '筑基中期',
    15: '筑基后期',
    16: '金丹初期',
    17: '金丹中期',
    18: '金丹后期',
    19: '元婴初期',
    20: '元婴中期',
    21: '元婴后期',
    22: '化神初期',
    23: '化神中期',
    24: '化神后期',
    25: '返虚初期',
    26: '元婴初期 - 返',
    27: '返虚中期',
    28: '元婴中期 - 返',
    29: '返虚后期',
    30: '元婴后期 - 返',
    31: '渡劫期'
}

export function isPoJing(level: number ): boolean {
    return [12, 15, 18, 21, 24, 30].includes(level);
}